witalis3/UA3REO-DDC-Transceiver/STM32/Src/wifi.c
														RTC_Calibration();
														println("[RTC] New RTC Calibration value: ", CALIBRATE.RTC_Calibration);
													}

													//set time
													RTC_TimeTypeDef sTime;
													sTime.TimeFormat = RTC_HOURFORMAT12_PM;
													sTime.SubSeconds = 0;
													sTime.SecondFraction = 0;
													sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
													sTime.StoreOperation = RTC_STOREOPERATION_SET;
													sTime.Hours = hrs;
													sTime.Minutes = min;
													sTime.Seconds = sec;
													RTC_DateTypeDef sDate;
													sDate.Date = day;
													sDate.Month = month;
													sDate.Year = year_short;
													BKPSRAM_Enable();
													HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
													HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
													println("[RTC] New time set")
												}
												TRX_SNTP_Synced = HAL_GetTick();
												println("[WIFI] TIME SYNCED");

												//reset SNTP
												char com_t[64] = {0};
												sprintf(com_t, "AT+CIPSNTPCFG=1,%d,\"0.pool.ntp.org\",\"1.pool.ntp.org\"\r\n", TRX.WIFI_TIMEZONE);
												WIFI_SendCommand(com_t); //configure SNMP
												WIFI_WaitForOk();
											}
										}
									}
								}
							}
						}
					}
				}
			}
			else if (WIFI_ProcessingCommand == WIFI_COMM_GETIP) //GetIP Command process
			{
				char *sep = "_CUR:ip";
				char *istr;
				istr = strstr(WIFI_readedLine, sep);
				if (istr != NULL)
				{
					char *start = strchr(WIFI_readedLine, '"');
					if (start != NULL)
					{
						start = start + 1;
						char *end = strchr(start, '"');
						if (end != NULL)
						{
							*end = 0x00;
							strcpy(WIFI_IP, start);
							println("[WIFI] GOT IP: ", WIFI_IP);
							WIFI_IP_Gotted = true;
							if (LCD_systemMenuOpened)
								LCD_UpdateQuery.SystemMenuRedraw = true;
						}
					}
				}
			}
			else if (WIFI_ProcessingCommand == WIFI_COMM_TCP_GET_RESPONSE) //GetIP Command process
			{
				char *istr;
				istr = strstr(WIFI_readedLine, "+IPD");
				if (istr != NULL)
					WIFI_getHTTPResponse();
			}
		}
		break;

	case WIFI_UNDEFINED:
	case WIFI_NOTFOUND:
	case WIFI_REINIT:
	case WIFI_FAIL:
	case WIFI_SLEEP:
		break;
	}
}

bool WIFI_GetSNTPTime(void (*callback)(void))
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_GETSNTP;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_SendCommand("AT+CIPSNTPTIME?\r\n"); //get SNMP time
	return true;
}

bool WIFI_GetIP(void (*callback)(void))
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_GETIP;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_SendCommand("AT+CIPSTA_CUR?\r\n"); //get ip
	return true;
}

bool WIFI_ListAP(void (*callback)(void))
{
	if (WIFI_State != WIFI_READY && WIFI_State != WIFI_CONFIGURED)
		return false;
	if (WIFI_State == WIFI_CONFIGURED && !WIFI_stop_auto_ap_list && WIFI_ProcessingCommand == WIFI_COMM_LISTAP) // stop auto-connection when searching for networks
	{
		WIFI_stop_auto_ap_list = true;
		WIFI_WaitForOk();
	}
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_LISTAP;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_FoundedAP_Index = 0;

	for (uint8_t i = 0; i < WIFI_FOUNDED_AP_MAXCOUNT; i++)
		dma_memset((char *)&WIFI_FoundedAP_InWork[i], 0x00, sizeof WIFI_FoundedAP_InWork[i]);
	WIFI_SendCommand("AT+CWLAP\r\n"); //List AP
	return true;
}

static bool WIFI_ListAP_Sync(void)
{
	WIFI_SendCommand("AT+CWLAP\r\n"); //List AP
	WIFI_FoundedAP_Index = 0;
	for (uint8_t i = 0; i < WIFI_FOUNDED_AP_MAXCOUNT; i++)
		dma_memset((char *)&WIFI_FoundedAP[i], 0x00, sizeof WIFI_FoundedAP[i]);
	uint32_t startTime = HAL_GetTick();
	char *sep = "OK";
	char *istr;

	while ((HAL_GetTick() - startTime) < WIFI_COMMAND_TIMEOUT)
	{
		if (!WIFI_TryGetLine())
		{
			CPULOAD_GoToSleepMode();
			CPULOAD_WakeUp();
			continue;
		}

		istr = strstr(WIFI_readedLine, sep);
		if (istr != NULL)
			return true;

		if (strlen(WIFI_readedLine) > 5) //-V814
		{
			char *start = strchr(WIFI_readedLine, '"');
			if (start != NULL)
			{
				start = start + 1;
				char *end = strchr(start, '"');
				if (end != NULL)
				{
					*end = 0x00;
					strcat((char *)&WIFI_FoundedAP[WIFI_FoundedAP_Index], start);
					if (WIFI_FoundedAP_Index < (WIFI_FOUNDED_AP_MAXCOUNT - 1))
						WIFI_FoundedAP_Index++;
				}
			}
		}
	}
	return false;
}

void WIFI_GoSleep(void)
{
	if (WIFI_State == WIFI_SLEEP)
		return;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_DEEPSLEEP;
	WIFI_SendCommand("AT+GSLP=1000\r\n"); //go sleep
	WIFI_State = WIFI_SLEEP;
	WIFI_connected = false;
	LCD_UpdateQuery.StatusInfoGUI = true;
}

static void WIFI_SendCommand(char *command)
{
	HAL_UART_AbortReceive(&huart6);
	HAL_UART_AbortReceive_IT(&huart6);
	dma_memset(WIFI_AnswerBuffer, 0x00, sizeof(WIFI_AnswerBuffer));
	WIFI_Answer_ReadIndex = 0;
	HAL_UART_Receive_DMA(&huart6, (uint8_t *)WIFI_AnswerBuffer, WIFI_ANSWER_BUFFER_SIZE);
	HAL_UART_Transmit_IT(&huart6, (uint8_t *)command, (uint16_t)strlen(command));
	commandStartTime = HAL_GetTick();
	HAL_Delay(WIFI_COMMAND_DELAY);
	if (TRX.Debug_Type == TRX_DEBUG_WIFI) //DEBUG
		print("WIFI_S: ", command);
}

static bool WIFI_WaitForOk(void)
{
	char *sep = "OK";
	char *sep2 = "ERROR";
	char *istr;
	uint32_t startTime = HAL_GetTick();
	while ((HAL_GetTick() - startTime) < WIFI_COMMAND_TIMEOUT)
	{
		if (WIFI_TryGetLine())
		{
			//OK
			istr = strstr(WIFI_readedLine, sep);
			if (istr != NULL)
				return true;
			//ERROR
			istr = strstr(WIFI_readedLine, sep2);
			if (istr != NULL)
				return false;
		}
		CPULOAD_GoToSleepMode();
		CPULOAD_WakeUp();
	}
	return false;
}

static bool WIFI_TryGetLine(void)
{
	dma_memset(WIFI_readedLine, 0x00, sizeof(WIFI_readedLine));
	dma_memset(tmp, 0x00, sizeof(tmp));

	Aligned_CleanInvalidateDCache_by_Addr((uint32_t)WIFI_AnswerBuffer, sizeof(WIFI_AnswerBuffer));
	uint16_t dma_index = WIFI_ANSWER_BUFFER_SIZE - (uint16_t)__HAL_DMA_GET_COUNTER(huart6.hdmarx);
	if (WIFI_Answer_ReadIndex == dma_index)
		return false;

	if (dma_index < WIFI_Answer_ReadIndex)
	{
		//tail
		uint32_t len = WIFI_ANSWER_BUFFER_SIZE - WIFI_Answer_ReadIndex;
		strncpy(tmp, &WIFI_AnswerBuffer[WIFI_Answer_ReadIndex], len);
		//head
		strncat(tmp, &WIFI_AnswerBuffer[0], dma_index);
	}
	else
	{
		//head
		strncpy(tmp, &WIFI_AnswerBuffer[WIFI_Answer_ReadIndex], dma_index - WIFI_Answer_ReadIndex);
	}

