witalis3/UA3REO-DDC-Transceiver/STM32/Src/wifi.c
	if (tmp[0] == '\0')
		return false;

	char *istr = strchr(tmp, '\n'); // look for the end of the line
	if (istr == NULL)
		return false;

	uint32_t len = (uint16_t)((uint32_t)istr - (uint32_t)tmp + 1);
	if (len > WIFI_LINE_BUFFER_SIZE)
		return false;
	strncpy(WIFI_readedLine, tmp, len);

	WIFI_Answer_ReadIndex += len;
	if (WIFI_Answer_ReadIndex >= WIFI_ANSWER_BUFFER_SIZE)
	{
		WIFI_Answer_ReadIndex -= WIFI_ANSWER_BUFFER_SIZE;
	}

	if (TRX.Debug_Type == TRX_DEBUG_WIFI) //DEBUG
		print("WIFI_R: ", WIFI_readedLine);

	return true;
}

bool WIFI_StartCATServer(void (*callback)(void))
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_CREATESERVER;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_SendCommand("AT+CIPSERVER=1,6784\r\n"); //Start CAT Server
	return true;
}

bool WIFI_SendCatAnswer(char *data, uint32_t link_id, void (*callback)(void))
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_SENDTCPDATA;
	WIFI_ProcessingCommandCallback = callback;
	char answer[64] = {0};
	sprintf(answer, "AT+CIPSEND=%u,%u\r\n", link_id, strlen(data));
	WIFI_SendCommand(answer); //Send CAT answer
	char answer_data[64] = {0};
	strcat(answer_data, data);
	strcat(answer_data, "\r");
	WIFI_SendCommand(answer_data); //Send CAT answer data
	WIFI_ProcessingCommand = WIFI_COMM_NONE;
	WIFI_State = WIFI_READY;
	return true;
}

bool WIFI_UpdateFW(void (*callback)(void))
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_UPDATEFW;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_SendCommand("AT+CIUPDATE\r\n"); //Start Update Firmware
	//WIFI_WaitForOk();
	return true;
}

static void WIFI_getHTTPResponse(void)
{
	uint32_t readed_body_length = 0;
	char *istr;
	istr = strstr(WIFI_readedLine, "+IPD");
	if (istr != NULL)
	{
		istr += 7;
		char *istr2 = strchr(WIFI_readedLine, ':');
		if (istr2 != NULL)
		{
			*istr2 = 0;
			uint32_t response_length = atoi(istr);
			istr2++;
			strcpy(WIFI_HTTResponseHTML, istr2);
			commandStartTime = HAL_GetTick();

			uint32_t start_time = HAL_GetTick();
			uint32_t len = strlen(WIFI_HTTResponseHTML);
			while (len < response_length && len < sizeof(WIFI_HTTResponseHTML) && (HAL_GetTick() - start_time) < 5000)
			{
				if (WIFI_TryGetLine())
				{
					if (len + strlen(WIFI_readedLine) < sizeof(WIFI_HTTResponseHTML))
						strcat(WIFI_HTTResponseHTML, WIFI_readedLine);
					else
						break;
				}
				len = strlen(WIFI_HTTResponseHTML);
			}
			char *istr3 = WIFI_HTTResponseHTML;
			istr3 += response_length;
			*istr3 = 0;

			//get status
			char *istr4 = strchr(WIFI_HTTResponseHTML, ' ');
			if (istr4 != NULL)
			{
				char *istr5 = istr4 + 4;
				*istr5 = 0;
				WIFI_HTTP_Response_Status = (uint16_t)(atoi(istr4));
				*istr5 = ' ';
			}

			//get content length
			istr4 = strstr(WIFI_HTTResponseHTML, "Content-Length: ");
			if (istr4 != NULL)
			{
				istr4 += 16;
				char *istr5 = strchr(istr4, '\r');
				if (istr5 != NULL)
				{
					*istr5 = 0;
					WIFI_HTTP_Response_ContentLength = (uint32_t)(atoi(istr4));
					*istr5 = ' ';
				}
			}

			//get response body
			char *istr6 = strstr(WIFI_HTTResponseHTML, "\r\n\r\n");
			if (istr6 != NULL)
			{
				istr6 += 4;
				strcpy(WIFI_HTTResponseHTML, istr6);
			}

			//partial callback for image printing
			readed_body_length += strlen(WIFI_HTTResponseHTML);
			if (WIFI_ProcessingCommandCallback == WIFI_printImage_stream_callback)
				WIFI_printImage_stream_partial_callback();

			//may be partial content? continue downloading
			start_time = HAL_GetTick();
			if (readed_body_length < WIFI_HTTP_Response_ContentLength && (HAL_GetTick() - start_time) < 3000)
			{
				while (readed_body_length < WIFI_HTTP_Response_ContentLength && strlen(WIFI_HTTResponseHTML) < sizeof(WIFI_HTTResponseHTML) && (HAL_GetTick() - start_time) < 3000)
				{
					if (WIFI_TryGetLine())
					{
						istr = strstr(WIFI_readedLine, "+IPD");
						if (istr != NULL)
						{
							istr += 7;
							istr2 = strchr(WIFI_readedLine, ':');
							if (istr2 != NULL)
							{
								*istr2 = 0;
								response_length = atoi(istr);
								istr2++;
								strncat(WIFI_HTTResponseHTML, istr2, response_length);

								//partial callback for image printing
								readed_body_length += strlen(WIFI_HTTResponseHTML);
								if (WIFI_ProcessingCommandCallback == WIFI_printImage_stream_callback)
									WIFI_printImage_stream_partial_callback();
							}
						}
					}
				}
			}

			//cut body on content-length
			if (strlen(WIFI_HTTResponseHTML) > WIFI_HTTP_Response_ContentLength)
				WIFI_HTTResponseHTML[WIFI_HTTP_Response_ContentLength] = 0;

			WIFI_ProcessingCommand = WIFI_COMM_NONE;
			WIFI_State = WIFI_READY;
			if (WIFI_ProcessingCommandCallback != NULL)
				WIFI_ProcessingCommandCallback();
		}
	}
}

static void WIFI_sendHTTPRequest(void)
{
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_TCP_GET_RESPONSE;
	dma_memset(WIFI_HTTRequest, 0x00, sizeof(WIFI_HTTRequest));
	strcat(WIFI_HTTRequest, "GET ");
	strcat(WIFI_HTTRequest, WIFI_GETuri);
	strcat(WIFI_HTTRequest, " HTTP/1.1\r\n");
	strcat(WIFI_HTTRequest, "Host: ");
	strcat(WIFI_HTTRequest, WIFI_HOSTuri);
	strcat(WIFI_HTTRequest, "\r\nConnection: close\r\n\r\n");
	char comm_line[64] = {0};
	sprintf(comm_line, "AT+CIPSEND=0,%d\r\n", strlen(WIFI_HTTRequest));
	WIFI_SendCommand(comm_line);
	WIFI_SendCommand(WIFI_HTTRequest);
}

bool WIFI_getHTTPpage(char *host, char *url, void (*callback)(void), bool https)
{
	if (WIFI_State != WIFI_READY)
		return false;
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_TCP_CONNECT;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_HTTP_Response_Status = 0;

	dma_memset(WIFI_HOSTuri, 0x00, sizeof(WIFI_HOSTuri));
	strcat(WIFI_HOSTuri, "AT+CIPSTART=0,");
	if (!https)
		strcat(WIFI_HOSTuri, "\"TCP\"");
	else
		strcat(WIFI_HOSTuri, "\"SSL\"");
	strcat(WIFI_HOSTuri, ",\"");
	strcat(WIFI_HOSTuri, host);

