witalis3/UA3REO-DDC-Transceiver/STM32/Src/wifi.c
	if (!https)
		strcat(WIFI_HOSTuri, "\",80,10\r\n");
	else
		strcat(WIFI_HOSTuri, "\",443,10\r\n");

	dma_memset(WIFI_GETuri, 0x00, sizeof(WIFI_GETuri));
	strcat(WIFI_GETuri, url);

	WIFI_SendCommand(WIFI_HOSTuri);

	dma_memset(WIFI_HOSTuri, 0x00, sizeof(WIFI_HOSTuri));
	strcat(WIFI_HOSTuri, host);
	return true;
}

static void WIFI_printText_callback(void)
{
	LCDDriver_Fill(BG_COLOR);
	if (WIFI_HTTP_Response_Status == 200)
	{
		LCDDriver_printTextFont(WIFI_HTTResponseHTML, 0, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
	}
	else
		LCDDriver_printTextFont("Network error", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
}

static void WIFI_printImage_stream_partial_callback(void)
{
	dma_memset(WIFI_RLEStreamBuffer, 0x00, sizeof(WIFI_RLEStreamBuffer));
	//parse hex output from server (convert to bin)
	char *istr = WIFI_HTTResponseHTML;
	char hex[5] = {0};
	WIFI_RLEStreamBuffer_index = 0;
	int16_t val = 0;
	uint32_t len = strlen(WIFI_HTTResponseHTML);
	while (*istr != 0 && (len >= ((WIFI_RLEStreamBuffer_index * 4) + 4)))
	{
		//Get hex
		strncpy(hex, istr, 4);
		val = (int16_t)(strtol(hex, NULL, 16));
		istr += 4;
		//Save
		WIFI_RLEStreamBuffer[WIFI_RLEStreamBuffer_index] = val;
		WIFI_RLEStreamBuffer_index++;
	}

	//send to LCD RLE stream decoder
	LCDDriver_printImage_RLECompressed_ContinueStream(WIFI_RLEStreamBuffer, WIFI_RLEStreamBuffer_index);

	//clean answer
	if (strlen(WIFI_HTTResponseHTML) > (WIFI_RLEStreamBuffer_index * 4)) //part buffer preceed, move to begin
	{
		istr = &WIFI_HTTResponseHTML[(WIFI_RLEStreamBuffer_index * 4)];
		strcpy(WIFI_HTTResponseHTML, istr);
	}
	else
		dma_memset(WIFI_HTTResponseHTML, 0x00, sizeof(WIFI_HTTResponseHTML));
}

static void WIFI_printImage_stream_callback(void)
{
	//image print stream done
}

static void WIFI_printImage_callback(void)
{
	LCDDriver_Fill(BG_COLOR);
	if (WIFI_HTTP_Response_Status == 200)
	{
		char *istr1 = strchr(WIFI_HTTResponseHTML, ',');
		if (istr1 != NULL)
		{
			*istr1 = 0;
			uint32_t filesize = atoi(WIFI_HTTResponseHTML);
			istr1++;
			char *istr2 = strchr(istr1, ',');
			if (istr2 != NULL)
			{
				*istr2 = 0;
				uint16_t width = (uint16_t)(atoi(istr1));
				istr2++;

				uint16_t height = (uint16_t)(atoi(istr2));

				if (filesize > 0 && width > 0 && height > 0)
				{
					LCDDriver_printImage_RLECompressed_StartStream(LCD_WIDTH / 2 - width / 2, LCD_HEIGHT / 2 - height / 2, width, height);
					WIFI_RLEStreamBuffer_part = 0;
					WIFI_getHTTPpage("ua3reo.ru", "/trx_services/propagination.php?part=0", WIFI_printImage_stream_callback, false);
				}
			}
		}
	}
	else
		LCDDriver_printTextFont("Network error", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
}

void WIFI_getRDA(void)
{
	LCDDriver_Fill(BG_COLOR);
	if (WIFI_connected && WIFI_State == WIFI_READY)
		LCDDriver_printTextFont("Loading...", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
	else
	{
		LCDDriver_printTextFont("No connection", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
		return;
	}
	char url[64] = "/trx_services/rda.php?callsign=";
	strcat(url, TRX.CALLSIGN);
	WIFI_getHTTPpage("ua3reo.ru", url, WIFI_printText_callback, false);
}

void WIFI_getDXCluster(void)
{
	LCDDriver_Fill(BG_COLOR);
	if (WIFI_connected && WIFI_State == WIFI_READY)
		LCDDriver_printTextFont("Loading...", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
	else
	{
		LCDDriver_printTextFont("No connection", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
		return;
	}
	char url[64] = "/trx_services/cluster.php?band=";
	int8_t band = getBandFromFreq(CurrentVFO()->Freq, true);
	if(band >= 0)
		strcat(url, BANDS[band].name);
	WIFI_getHTTPpage("ua3reo.ru", url, WIFI_printText_callback, false);
}

void WIFI_getPropagination(void)
{
	LCDDriver_Fill(BG_COLOR);
	if (WIFI_connected && WIFI_State == WIFI_READY)
		LCDDriver_printTextFont("Loading...", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
	else
	{
		LCDDriver_printTextFont("No connection", 10, 20, FG_COLOR, BG_COLOR, &FreeSans9pt7b);
		return;
	}
	WIFI_getHTTPpage("ua3reo.ru", "/trx_services/propagination.php", WIFI_printImage_callback, false);
}

bool WIFI_SW_Restart(void (*callback)(void))
{
	println("[WIFI] SW Restart");
	WIFI_State = WIFI_PROCESS_COMMAND;
	WIFI_ProcessingCommand = WIFI_COMM_SW_RESTART;
	WIFI_ProcessingCommandCallback = callback;
	WIFI_SendCommand("AT+RST\r\n"); //Start Update Firmware
	//WIFI_WaitForOk();
	return true;
}

static void WIFI_checkFWUpdates_callback(void)
{
	if (WIFI_HTTP_Response_Status == 200)
	{
		if(strstr(WIFI_HTTResponseHTML,"new all") != NULL)
		{
			WIFI_NewFW_STM32 = true;
			WIFI_NewFW_FPGA = true;
			LCD_showTooltip("New Firmware available");
		}
		else if(strstr(WIFI_HTTResponseHTML,"new stm32") != NULL)
		{
			WIFI_NewFW_STM32 = true;
			LCD_showTooltip("New STM32 FW available");
		}
		else if(strstr(WIFI_HTTResponseHTML,"new fpga") != NULL)
		{
			WIFI_NewFW_FPGA = true;
			LCD_showTooltip("New FPGA FW available");
		}
	}
	WIFI_NewFW_checked = true;
}

void WIFI_checkFWUpdates(void)
{
	if (WIFI_connected && WIFI_State != WIFI_READY)
		return;
	char url[128];
	sprintf(url, "/trx_services/check_fw_updates.php?dev=0&stm32=%s&fpga=%d.%d.%d", version_string, FPGA_FW_Version[2], FPGA_FW_Version[1], FPGA_FW_Version[0]);
	WIFI_getHTTPpage("ua3reo.ru", url, WIFI_checkFWUpdates_callback, false);
}
